Terraform plan for __sandbox__
<details>
  <summary>Plan: 23 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "ebo-sandbox-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "cloudbuild.googleapis.com"
    }

  # google_project_service.project_services["clouddebugger.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "clouddebugger.googleapis.com"
    }

  # google_project_service.project_services["cloudfunctions.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "cloudfunctions.googleapis.com"
    }

  # google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "cloudkms.googleapis.com"
    }

  # google_project_service.project_services["cloudtasks.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "cloudtasks.googleapis.com"
    }

  # google_project_service.project_services["cloudtrace.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "cloudtrace.googleapis.com"
    }

  # google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "container.googleapis.com"
    }

  # google_project_service.project_services["dataflow.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "dataflow.googleapis.com"
    }

  # google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "dns.googleapis.com"
    }

  # google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "iap.googleapis.com"
    }

  # google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "monitoring.googleapis.com"
    }

  # google_project_service.project_services["oslogin.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "oslogin.googleapis.com"
    }

  # google_project_service.project_services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "pubsub.googleapis.com"
    }

  # google_project_service.project_services["redis.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "redis.googleapis.com"
    }

  # google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "secretmanager.googleapis.com"
    }

  # google_project_service.project_services["servicecontrol.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "servicecontrol.googleapis.com"
    }

  # google_project_service.project_services["servicemanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "servicemanagement.googleapis.com"
    }

  # google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "servicenetworking.googleapis.com"
    }

  # google_project_service.project_services["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ebo-sandbox"
      + service                    = "sqladmin.googleapis.com"
    }

Plan: 23 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #109](https://github.com/ebomart/commerce-infrastructure/actions/runs/1142832942)